---
title: GeometryFailures
classe: Autodesk.Revit.DB.BuiltInFailures+GeometryFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 18
---

# GeometryFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotFindClosest { get; }` | `GeometryFailures.CannotFindClosest` | FailureDefinitionId |
| `FailureDefinitionId ConvertFaceRegionsToFacesCrashed { get; }` | `GeometryFailures.ConvertFaceRegionsToFacesCrashed` | FailureDefinitionId |
| `FailureDefinitionId ConvertFaceRegionsToFacesFailed { get; }` | `GeometryFailures.ConvertFaceRegionsToFacesFailed` | FailureDefinitionId |
| `FailureDefinitionId CurveAndSurfaceDoNotIntersect { get; }` | `GeometryFailures.CurveAndSurfaceDoNotIntersect` | FailureDefinitionId |
| `FailureDefinitionId CurveDriverError { get; }` | `GeometryFailures.CurveDriverError` | FailureDefinitionId |
| `FailureDefinitionId CurveProjectTooShort { get; }` | `GeometryFailures.CurveProjectTooShort` | FailureDefinitionId |
| `FailureDefinitionId ElementIsTooThin { get; }` | `GeometryFailures.ElementIsTooThin` | FailureDefinitionId |
| `FailureDefinitionId ElementTooSmall { get; }` | `GeometryFailures.ElementTooSmall` | FailureDefinitionId |
| `FailureDefinitionId FailedReplaceCurveElemCurveDriver { get; }` | `GeometryFailures.FailedReplaceCurveElemCurveDriver` | FailureDefinitionId |
| `FailureDefinitionId FailedUpdateCurveChain { get; }` | `GeometryFailures.FailedUpdateCurveChain` | FailureDefinitionId |
| `FailureDefinitionId FailToConvertLine { get; }` | `GeometryFailures.FailToConvertLine` | FailureDefinitionId |
| `FailureDefinitionId LineArcTangentFailure { get; }` | `GeometryFailures.LineArcTangentFailure` | FailureDefinitionId |
| `FailureDefinitionId OffsetFaceFailed { get; }` | `GeometryFailures.OffsetFaceFailed` | FailureDefinitionId |
| `FailureDefinitionId PolygonSegmentTooShort { get; }` | `GeometryFailures.PolygonSegmentTooShort` | FailureDefinitionId |
| `FailureDefinitionId SiteInvisible { get; }` | `GeometryFailures.SiteInvisible` | FailureDefinitionId |
| `FailureDefinitionId SuccessToConvertLine { get; }` | `GeometryFailures.SuccessToConvertLine` | FailureDefinitionId |
| `FailureDefinitionId SymbolicLineInvalidPlane { get; }` | `GeometryFailures.SymbolicLineInvalidPlane` | FailureDefinitionId |
| `FailureDefinitionId TooManyFacesEdges { get; }` | `GeometryFailures.TooManyFacesEdges` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```